## Importing Libraries

In [99]:
from sqlalchemy import create_engine
import pandas as pd

## Creating Connection

In [100]:
DB_USER = "postgres"
DB_PASSWORD = "Vansh7206"
DB_HOST = "localhost"
DB_PORT = "5432"
DB_NAME = "ai_learning_db"

engine = create_engine(
    f"postgresql+psycopg2://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
)

print("✅ PostgreSQL connected successfully")

✅ PostgreSQL connected successfully

## Normal Check

In [101]:
pd.read_sql("SELECT version();", engine)

                                             version
0  PostgreSQL 18.1 on x86_64-windows, compiled by...

## Loading csv file into 'df' variable

In [102]:
df = pd.read_csv(r"C:\Users\vchan\Downloads\AI_Student.csv")

## Loading csv file into database

In [103]:
df.to_sql(
    "ai_sessions",
    engine,
    if_exists="replace",   # use replace only first time
    index=False
)

print("✅ Data loaded into PostgreSQL")

✅ Data loaded into PostgreSQL

## Query 1: Checking if everything works alright

In [104]:
query = """
SELECT *
FROM ai_sessions
LIMIT 5;
"""

pd.read_sql(query, engine)

,SessionID,StudentLevel,Discipline,SessionDate,SessionLengthMin,TotalPrompts,TaskType,AI_AssistanceLevel,FinalOutcome,UsedAgain,SatisfactionRating,Year,Month
0,SESSION00001,Undergraduate,Computer Science,03-11-2024,31.20,11,Studying,2,Assignment Completed,True,1.0,2024,11
1,SESSION00002,Undergraduate,Psychology,25-08-2024,13.09,6,Studying,3,Assignment Completed,True,2.0,2024,8
2,SESSION00003,Undergraduate,Business,12-01-2025,19.22,5,Coding,3,Assignment Completed,True,3.3,2025,1
3,SESSION00004,Undergraduate,Computer Science,06-05-2025,3.70,1,Coding,3,Assignment Completed,True,3.5,2025,5
4,SESSION00005,Undergraduate,Psychology,18-03-2025,28.12,9,Writing,3,Assignment Completed,True,2.9,2025,3

## Query 2:Total Sessions done

In [105]:
query = """
select count(*) as total_sessions
from ai_sessions;
"""
print('Total Sessions:')
pd.read_sql(query,engine)

Total Sessions:

   total_sessions
0           10000

## Query 3:Types of Student

In [106]:
query = """
SELECT "StudentLevel",
       COUNT(*) AS types_student
FROM ai_sessions
GROUP BY "StudentLevel"
ORDER BY types_student DESC;
"""
print('Student Level using AI:')
pd.read_sql(query, engine)

Student Level using AI:

    StudentLevel  types_student
0  Undergraduate           5978
1    High School           2027
2       Graduate           1995

## Query 4:Degree of Students and their count

In [107]:
query = """
SELECT "Discipline",COUNT(*) as degree_student
FROM ai_sessions
GROUP BY "Discipline"
ORDER BY degree_student;
"""
print('Feilds of People using AI:')
pd.read_sql(query,engine)

Feilds of People using AI:

         Discipline  degree_student
0          Business            1410
1           History            1417
2        Psychology            1418
3              Math            1422
4       Engineering            1430
5  Computer Science            1445
6           Biology            1458

## Query 5:Avgerage Session time in Minutes

In [108]:
query = """
SELECT AVG("SessionLengthMin") AS AVG_SESSION_TIME_MINS
FROM ai_sessions;
"""
print('Average Session time:')
pd.read_sql(query,engine)

Average Session time:

   avg_session_time_mins
0              19.846467

## Query 6: Average Prompts by user in a session

In [109]:
query = """
SELECT AVG("TotalPrompts") AS AVG_PROMPTS
FROM ai_sessions;
"""
print('')
print('Average Prompts per session:')
pd.read_sql(query,engine)

Average Prompts per session:

   avg_prompts
0       5.6075

## Query 7: Task Type and its count

In [110]:
query = """
SELECT "TaskType",COUNT(*) AS TASK_Count
FROM ai_sessions
GROUP BY "TaskType"
ORDER BY TASK_Count DESC;
"""
print('Task done by people using AI:')
pd.read_sql(query,engine)

Task done by people using AI:

        TaskType  task_count
0        Writing        3101
1       Studying        2040
2  Homework Help        1959
3         Coding        1948
4       Research         476
5  Brainstorming         476

## Query 8: Final Outcome

In [111]:
query = """
SELECT "FinalOutcome",COUNT(*) AS count
FROM ai_sessions
GROUP BY "FinalOutcome"
ORDER BY count DESC;
"""
print('Message People get after using AI:')
pd.read_sql(query,engine)

Message People get after using AI:

           FinalOutcome  count
0  Assignment Completed   4768
1          Idea Drafted   2866
2              Confused   1613
3               Gave Up    753

## Query 9: Do people reuse AI?

In [112]:
query = """
SELECT "UsedAgain",COUNT(*)
FROM ai_sessions
GROUP BY "UsedAgain";
"""
print('Count of people reusing and not reusing AI:')
pd.read_sql(query,engine)

Count of people reusing and not reusing AI:

   UsedAgain  count
0      False   2936
1       True   7064

## Query 10 : Avg Satisfaction Rating

In [113]:
query = """
SELECT AVG("SatisfactionRating") AS AVG_SATISFACTION
FROM ai_sessions;
"""
print('Average Satisfaction Rating of using AI:')
pd.read_sql(query,engine)

Average Satisfaction Rating of using AI:

   avg_satisfaction
0           3.41778

## Query 11:Use of AI within Months

In [114]:
query = """
SELECT "Month",count(*) as ai_use_months
from ai_sessions
group by "Month"
order by ai_use_months desc;
"""
print('Use of AI within Months:')
pd.read_sql(query,engine)

Use of AI within Months:

    Month  ai_use_months
0       8            899
1       6            898
2       1            884
3       7            858
4       5            842
5       4            837
6       9            817
7       3            810
8      11            808
9      10            802
10      2            779
11     12            766

## Query 12: 2024 vs 2025

In [115]:
query = """
SELECT "Year",COUNT(*) AS total_sessions
FROM ai_sessions
GROUP BY "Year"
ORDER BY "Year";
"""
print('Use of AI in following years:')
pd.read_sql(query, engine)

Use of AI in following years:

   Year  total_sessions
0  2024            5158
1  2025            4842

## Query 13: Student Analysis Level Wise

In [116]:
query = """
SELECT "StudentLevel",AVG("SessionLengthMin") as AVG_Session_Length,AVG("TotalPrompts") AS Avg_Prompts
FROM ai_sessions
GROUP BY "StudentLevel"
ORDER BY AVG_Session_Length DESC;
"""
pd.read_sql(query,engine)

    StudentLevel  avg_session_length  avg_prompts
0       Graduate           20.252236     5.787469
1    High School           20.023740     5.619142
2  Undergraduate           19.650943     5.543493

## Query 13: Student Analysis Discpline Wise

In [117]:
query = """
SELECT "Discipline",AVG("SessionLengthMin") as AVG_Session_Length,AVG("TotalPrompts") AS Avg_Prompts
FROM ai_sessions
GROUP BY "Discipline"
ORDER BY AVG_Session_Length DESC;
"""
pd.read_sql(query,engine)

         Discipline  avg_session_length  avg_prompts
0       Engineering           20.143937     5.639161
1           Biology           19.944959     5.657064
2        Psychology           19.903357     5.640339
3          Business           19.884645     5.551064
4           History           19.762816     5.657728
5  Computer Science           19.679170     5.571626
6              Math           19.605113     5.534459

## Query 14: Repeat Rate of Users based on what outcome they got in past

In [120]:
query = """
select "FinalOutcome","UsedAgain",count(*) as count
from ai_sessions
group by "FinalOutcome","UsedAgain"
order by "FinalOutcome", count desc;
"""
pd.read_sql(query,engine)

           FinalOutcome  UsedAgain  count
0  Assignment Completed       True   3844
1  Assignment Completed      False    924
2              Confused      False    965
3              Confused       True    648
4               Gave Up      False    447
5               Gave Up       True    306
6          Idea Drafted       True   2266
7          Idea Drafted      False    600

## Query 15: Satisfaction Rating based on session length

In [125]:
query = """
SELECT CASE WHEN "SatisfactionRating" >= 1 AND "SatisfactionRating" < 2 THEN '1-2' 
WHEN "SatisfactionRating" >= 2 AND "SatisfactionRating" < 3 THEN '2-3'
WHEN "SatisfactionRating" >= 3 AND "SatisfactionRating" < 4 THEN '3-4'
WHEN "SatisfactionRating" >= 4 AND "SatisfactionRating" <= 5 THEN '4-5'
END AS rating, ROUND(AVG("SessionLengthMin")::numeric, 2) AS avg_session_length
FROM ai_sessions
GROUP BY rating
ORDER BY rating;
"""
pd.read_sql(query, engine)

  rating  avg_session_length
0    1-2               20.12
1    2-3               20.08
2    3-4               19.88
3    4-5               19.59

## Query 16 : Use of Assitance Level

In [130]:
query = """
SELECT "AI_AssistanceLevel",
       COUNT(*) AS total_sessions
FROM ai_sessions
GROUP BY "AI_AssistanceLevel"
ORDER BY total_sessions DESC;
"""
pd.read_sql(query, engine)

   AI_AssistanceLevel  total_sessions
0                   4            3451
1                   3            3361
2                   5            1591
3                   2            1356
4                   1             241

## Query 17: Use of Assistance Level Task-Wise

In [134]:
query = """
select "AI_AssistanceLevel","TaskType",count(*) as count
from ai_sessions
group by "AI_AssistanceLevel","TaskType"
order by "AI_AssistanceLevel",count desc;
"""
print(pd.read_sql(query,engine))
print('')
print('AI Assistance Level 3 is consistently the most frequently used level across multiple task types, followed by Level 4, indicating a preference for moderate-to-high AI support rather than minimal or maximum assistance.')

    AI_AssistanceLevel       TaskType  count
0                    1        Writing     75
1                    1       Studying     54
2                    1  Homework Help     46
3                    1         Coding     40
4                    1  Brainstorming     13
5                    1       Research     13
6                    2        Writing    449
7                    2       Studying    293
8                    2  Homework Help    247
9                    2         Coding    241
10                   2  Brainstorming     66
11                   2       Research     60
12                   3        Writing   1003
13                   3  Homework Help    675
14                   3       Studying    667
15                   3         Coding    667
16                   3       Research    181
17                   3  Brainstorming    168
18                   4        Writing   1087
19                   4       Studying    711
20                   4         Coding    673
21                   4  Homework Help    656
22                   4  Brainstorming    164
23                   4       Research    160
24                   5        Writing    487
25                   5  Homework Help    335
26                   5         Coding    327
27                   5       Studying    315
28                   5  Brainstorming     65
29                   5       Research     62

AI Assistance Level 3 is consistently the most frequently used level across multiple task types, followed by Level 4, indicating a preference for moderate-to-high AI support rather than minimal or maximum assistance.